/*global define*/
export default {

        //--------------------------------------------------------------------------
        //
        // 笔刷
        //
        //--------------------------------------------------------------------------

        /**
         * 固体刷
         */
        STYLE_SOLID : 0,
        /**
         * 阴影刷
         */
        STYLE_HATCHED : 2,

        //--------------------------------------------------------------------------
        //
        // 阴影刷样式。注：当笔刷为阴影刷时才生效。
        //
        //--------------------------------------------------------------------------

        /**
         * 水平线，形状如：-----
         */
        HATCHED_HORIZONTAL : 0,

        /**
         * 垂直线，形状如：|||||
         */
        HATCHED_VERTICAL : 1,

        /**
         * 反斜线,形状如：\\\\\
         */
        HATCHED_FDIAGONAL : 2,

        /**
         * 正斜线，形状如：/////
         */
        HATCHED_BDIAGONAL : 3,

        /**
         * 十字架，形状如：+++++
         */
        HATCHED_CROSS : 4,

        /**
         * 交叉线，形状如：xxxxx
         */
        HATCHED_DIAGCROSS : 5
    }