/*global define*/
export default {

    //--------------------------------------------------------------------------
    //
    // 简单笔的样式
    //
    //--------------------------------------------------------------------------

    /**
     * 实线
     */
    SIMPLE_STYLE_SOLID : 0,

    /**
     * 虚线
     */
    SIMPLE_STYLE_DASH : 1,

    /**
     * 点线
     */
    SIMPLE_STYLE_DOT : 2,

    /**
     * 短线-点线
     */
    SIMPLE_STYLE_DASHDOT : 3,

    /**
     * 短线-点-点
     */
    SIMPLE_STYLE_DASHDOTDOT : 4,

    /**
     * 无
     */
    SIMPLE_STYLE_NULL : 5,

    //--------------------------------------------------------------------------
    //
    // 高级笔的结合类型(化妆笔与几何笔设定)（化妆笔时，笔宽必须设为1）
    //
    //--------------------------------------------------------------------------

    /**
     * 化妆笔，值：0x00000000
     */
    EXT_PEN_COSMETIC : 0,

    /**
     * 几何笔，值：0x00010000
     */
    EXT_PEN_GEOMETRIC : 65536
}
